Revit 2027 API
ParameterTypeId.BoundaryDirectionX Property
 "X Translation"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId BoundaryDirectionX { get; }
Public Shared ReadOnly Property BoundaryDirectionX As ForgeTypeId
	Get
public:
static property ForgeTypeId^ BoundaryDirectionX {
	ForgeTypeId^ get ();
}
static member BoundaryDirectionX : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace